 
 ; *************************************************************** 
 ; 例1 - 在默认参数情况下打开新的Excel窗口并关闭 
 ; ***************************************************************** 
 #include  <Excel.au3> 
 $oExcel  =  _ExcelBookNew ()  ; 创建一个Microsoft Excel窗口 
 _ExcelBookClose ( $oExcel )  ;默认将文件保存至"我的文档"文件夹 
 
 ; *************************************************************** 
 ; 例2 - 在默认参数情况下打开新的Excel窗口并关闭 
 ; ***************************************************************** 
 #include  <Excel.au3> 
 $oExcel  =  _ExcelBookNew ()  ; 创建一个Microsoft Excel窗口 
 _ExcelBookClose ( $oExcel ,  0 )  ;使用该方法将: 1)关闭文件, 或2)当Excel窗口改变时提醒使用者 
 
 ; *************************************************************** 
 ; 例3 - 在默认参数情况下打开新的Excel窗口并关闭 
 ; ***************************************************************** 
 #include  <Excel.au3> 
 $oExcel  =  _ExcelBookNew ()  ; 创建一个Microsoft Excel窗口 
 _ExcelBookClose ( $oExcel ,  1 ,  0 )  ;该方法将保存并关闭文件, 无论是否发生改变都不会有任何普通提醒  

